app/controllers/manages_controller.rb

  def index
    @manages = Manage.all
---
SELECT "manages".* FROM "manages"

  def create
    @manage = Manage.new(manage_params)

    respond_to do |format|
      if @manage.save
---
INSERT INTO "manages" ("info", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["info", "hi"], ["details", ""], ["created_at", "2023-12-16 18:43:21.805719"], ["updated_at", "2023-12-16 18:43:21.805719"]]

  def destroy
    @manage.destroy!
---
DELETE FROM "manages" WHERE "manages"."id" = ?  [["id", 1]]

    def set_manage
      @manage = Manage.find(params[:id])
---
SELECT "manages".* FROM "manages" WHERE "manages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]